# ─── Taps ─────────────────────────────────────────────────

tap "minio/stable"
tap "mongodb/brew"

# ─── Core ─────────────────────────────────────────────────

brew "git"
brew "gh"
brew "fzf"
brew "tree"
brew "vim"
brew "neovim"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "p7zip"

# ─── Languages & runtimes ────────────────────────────────

brew "node"
brew "nvm"
brew "pnpm"
brew "python@3.13"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "php@8.4", link: true
brew "composer"
brew "openjdk@11"

# ─── Databases ────────────────────────────────────────────

brew "postgresql@16"
brew "mysql-client"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mongodb/brew/mongodb-database-tools"

# ─── DevOps & cloud ──────────────────────────────────────

brew "docker"
brew "docker-compose"
brew "azure-cli"
brew "helm"
brew "minio/stable/mc"

# ─── Media & tools ───────────────────────────────────────

brew "ffmpeg"
brew "whisper-cpp"
brew "swagger-codegen"

# ─── Apps ─────────────────────────────────────────────────

cask "ghostty"
cask "visual-studio-code"
cask "obsidian"
cask "claude"
cask "claude-code"
cask "figma"
cask "brave-browser"
cask "google-chrome"
cask "discord"
cask "telegram"
cask "whatsapp"
cask "spotify"
cask "slack"
cask "notion"
cask "bruno"
cask "dbeaver-community"
cask "sourcetree"
cask "obs"
cask "vlc"
cask "rectangle"
cask "monitorcontrol"
cask "the-unarchiver"
cask "rar"
cask "protonvpn"
cask "proton-pass"
cask "applite"
cask "keyclu"
cask "font-jetbrains-mono"
cask "gcloud-cli"
cask "openlens"

# ─── VS Code extensions ─────────────────────────────────

vscode "qufiwefefwoyn.kanagawa"
vscode "pkief.material-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "bradlc.vscode-tailwindcss"
vscode "formulahendry.auto-rename-tag"
vscode "aaron-bond.better-comments"
vscode "wix.vscode-import-cost"
vscode "wallabyjs.console-ninja"
vscode "mechatroner.rainbow-csv"
vscode "yzhang.markdown-all-in-one"
vscode "ritwickdey.liveserver"
vscode "redhat.vscode-yaml"
vscode "mtxr.sqltools"
vscode "github.vscode-github-actions"
vscode "anthropic.claude-code"
vscode "dsznajder.es7-react-js-snippets"
vscode "astro-build.astro-vscode"
vscode "prisma.prisma"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-python.debugpy"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "charliermarsh.ruff"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "bmewburn.vscode-intelephense-client"
vscode "shufo.vscode-blade-formatter"
vscode "shopify.theme-check-vscode"
vscode "lokalise.i18n-ally"
